using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace ai_center_final
{
    public class Patient
    {
        private static readonly string[] Surnames = new[]
        {
        "Смирнов","Иванов","Кузнецов","Соколов","Попов","Лебедев","Козлов","Новиков","Морозов","Петров","Волков","Соловьёв","Васильев","Зайцев","Павлов","Семёнов","Голубев","Виноградов","Богданов","Воробьёв","Фёдоров","Михайлов","Беляев","Тарасов","Белов","Комаров","Орлов","Киселёв","Макаров","Андреев","Ковалёв","Ильин","Гусев","Титов","Кузьмин","Кудрявцев","Баранов","Куликов","Алексеев","Степанов","Яковлев","Сорокин","Сергеев","Романов","Захаров","Борисов","Королёв","Герасимов","Пономарёв","Григорьев","Лазарев","Медведев","Ершов","Никитин","Соболев","Рябов","Поляков","Цветков","Данилов","Жуков","Фролов","Журавлёв","Николаев","Крылов","Максимов","Сидоров","Осипов","Белоусов","Федотов","Дорофеев","Егоров","Матвеев","Бобров","Дмитриев","Калинин","Анисимов","Петухов","Антонов","Тимофеев","Никифоров","Веселов","Филиппов","Марков","Большаков","Суханов","Миронов","Ширяев","Александров","Коновалов","Шестаков","Казаков","Ефимов","Денисов","Громов","Фомин","Давыдов","Мельников","Щербаков","Блинов","Колесников","Карпов","Афанасьев","Власов","Маслов","Исаков","Тихонов","Аксёнов","Гаврилов","Родионов","Котов","Горбунов","Кудряшов","Быков","Зуев","Третьяков","Савельев","Панов","Рыбаков","Суворов","Абрамов","Воронов","Мухин","Архипов","Трофимов","Мартынов","Емельянов","Горшков","Чернов","Овчинников","Селезнёв","Панфилов","Копылов","Михеев","Галкин","Назаров","Лобанов","Лукин","Беляков","Потапов","Некрасов","Хохлов","Жданов","Наумов","Шилов","Воронцов","Ермаков","Дроздов","Игнатьев","Савин","Логинов","Сафонов","Капустин","Кириллов","Моисеев","Елисеев","Кошелев","Костин","Горбачёв","Орехов","Ефремов","Исаев","Евдокимов","Калашников","Кабанов","Носков","Юдин","Кулагин","Лапин","Прохоров","Нестеров","Харитонов","Агафонов","Муравьёв","Ларионов","Федосеев","Зимин","Пахомов","Шубин","Игнатов","Филатов","Крюков","Рогов","Кулаков","Терентьев","Молчанов","Владимиров","Артемьев","Гурьев","Зиновьев","Гришин","Кононов","Дементьев","Ситников","Симонов","Мишин","Фадеев","Комиссаров","Мамонтов","Носов","Гуляев","Шаров","Устинов","Вишняков","Евсеев","Лаврентьев","Брагин","Константинов","Корнилов","Авдеев","Зыков","Бирюков","Шарапов","Никонов","Щукин","Дьячков","Одинцов","Сазонов","Якушев","Красильников","Гордеев","Самойлов","Князев","Беспалов","Уваров","Шашков","Бобылёв","Доронин","Белозёров","Рожков","Самсонов","Мясников","Лихачёв","Буров","Сысоев","Фомичёв","Русаков","Стрелков","Гущин","Тетерин","Колобов","Субботин","Фокин","Блохин","Селиверстов","Пестов","Кондратьев","Силин","Меркушев","Лыткин","Туров"
        };

        private static readonly string[] Male_names = new[]
        {
        "Александр","Алексей","Альберт","Анатолий","Андрей","Антон","Аристарх","Аркадий","Арсений","Артём","Артемий","Артур","Архипп","Афанасий","Богдан","Борис","Вадим","Валентин","Валерий","Валерьян","Василий","Венедикт","Вениамин","Викентий","Виктор","Виссарион","Виталий","Владимир","Владислав","Владлен","Влас","Всеволод","Вячеслав","Геннадий","Георгий","Герасим","Герман","Германн","Глеб","Гордей","Григорий","Даниил","Демид","Демьян","Денис","Дмитрий","Евгений","Егор","Ефим","Иван","Игнатий","Игорь","Илья","Иннокентий","Ираклий","Кирилл","Константин","Лев","Леонид","Леонтий","Макар","Максим","Марк","Мартын","Матвей","Мирон","Мирослав","Митрофан","Михаил","Мстислав","Назар","Нестор","Никанор","Никита","Никифор","Никодим","Николай","Олег","Павел","Пётр","Платон","Прохор","Родион","Родослав","Роман","Ростислав","Руслан","Савелий","Самуил","Святослав","Севастьян","Семён","Серафим","Сергей","Станислав","Степан","Тарас","Тимофей","Тимур","Тихон","Трифон","Трофим","Фёдор","Федот","Феликс","Филипп"
        };

        private static readonly string[] Female_names = new[]
        {
        "Агафья","Аглая","Агриппина","Акулина","Алевтина","Александра","Алина","Алла","Анастасия","Ангелина","Анжела","Анжелика","Анна","Антонина","Анфиса","Валентина","Валерия","Варвара","Василиса","Вера","Вероника","Виктория","Галина","Глафира","Дарья","Евгения","Евдокия","Евлампия","Екатерина","Елена","Елизавета","Епистима","Ермиония","Жанна","Зинаида","Злата","Зоя","Инга","Инесса","Инна","Иоанна","Ираида","Ирина","Ия","Капитолина","Карина","Каролина","Кира","Клавдия","Ксения","Лада","Лариса","Лидия","Лилия","Любовь","Людмила","Маргарита","Марина","Мария","Марфа","Матрёна","Милица","Мирослава","Надежда","Наталья","Нина","Нонна","Оксана","Октябрина","Олимпиада","Ольга","Пелагея","Полина","Прасковья","Рада","Раиса","Римма","Светлана","Серафима","Снежана","София","Таисия","Тамара","Татьяна","Ульяна","Урсула","Фаина","Феврония","Фёкла","Феодора","Юлия","Яна","Ярослава"
        };

        private static readonly string[] Middlenames = new[]
        {
        "Александров","Алексеев","Анатольев","Андреев","Антонов","Ануфриев","Аркадьев","Арсенов","Арсеньев","Артёмов","Артемьев","Артуров","Архипов","Афанасьев","Богданов","Борислав","Бориславов","Борисов","Борисыч","Вадимов","Валентинов","Валерианов","Валерьев","Валерьянов","Васильев","Вахтангов","Венедиктов","Вениаминов","Викентьев","Викторов","Виленов","Вилоров","Виссарионов","Витальев","Владиленов","Владимиров","Владиславов","Владленов","Власов","Вольфов","Всеволодов","Вячеславов","Гавриилов","Гаврилов","Гаджиев","Геннадиев","Геннадьев","Генрихов","Георгиев","Герасимов","Германов","Гертрудов","Глебов","Гордеев","Григорьев","Гурьев","Давидов","Давыдов","Даниилов","Данилов","Демидов","Демьянов","Денисов","Димитриев","Дмитриев","Дорофеев","Евгеньев","Евграфов","Евдокимов","Евсеев","Евстигнеев","Егоров","Елизаров","Елисеев","Емельянов","Еремеев","Ермилов","Ермолаев","Ерофеев","Ефимов","Ефимьев","Ефремов","Ефстафьев","Захаров","Захарьев","Зиновьев","Ибрагимов","Иванов","Игнатов","Игнатьев","Игорев","Константинов","Леонтьев","Львов","Макаров","Максимилианов","Максимов","Марков","Матвеев","Михайлов","Наумов","Никандров","Никаноров","Никит","Никитов","Никифоров","Никодимов","Николаев","Осипов","Павлов","Петров","Платонов","Прохоров","Романов","Ростиславов","Русланов","Семёнов","Сергеев","Сидоров","Сильвестров","Соломонов","Степанов","Тарасов","Теймуразов","Терентьев","Тимофеев","Тимуров","Тихонов","Трифонов","Трофимов","Устинов","Фёдоров","Федосеев","Федосьев","Федотов","Феликсов","Феодосьев","Феоктистов","Феофанов","Филатов","Филимонов","Филиппов"
        };

        private static readonly string[] Cities = new[]
        {
        "Анжеро-Судженск", "Белово", "Берёзовский", "Гурьевск", "Калтан", "Кемерово", "Киселёвск", "Ленинск-Кузнецкий", "Мариинск", "Междуреченск", "Мыски", "Новокузнецк", "Осинники", "Полысаево", "Прокопьевск", "Салаир", "Тайга", "Таштагол", "Топки", "Юрга"
        };

        public string FirstName { get; }
        public string MiddleName { get; }
        public string LastName { get; }
        public string Gender { get; }
        public string City { get; }
        public int SBP { get; }
        public int DBP { get; }
        public int Weight { get; }
        public int Height { get; }
        public int Cholesterol { get; }
        public bool Smoker { get; }
        public bool Diabetic { get; }
        public Patient()
        {
            var rng = new Random();
            var g = rng.Next() % 2;
            var s = rng.Next() % 2;
            var d = rng.Next() % 2;
            this.FirstName = ((g > 0) ? Male_names[rng.Next(Male_names.Length)] : Female_names[rng.Next(Female_names.Length)]);
            this.MiddleName = Middlenames[rng.Next(Middlenames.Length)] + ((g > 0) ? "ич" : "на");
            this.LastName = Surnames[rng.Next(Surnames.Length)] + ((g > 0) ? "" : "а");
            this.Gender = ((g > 0) ? "m" : "f");
            this.City = Cities[rng.Next(Cities.Length)];
            this.SBP = rng.Next(100, 180);
            this.DBP = rng.Next(60, 120);
            this.Weight = rng.Next(60, 120);
            this.Height = rng.Next(160, 200);
            this.Cholesterol = rng.Next(30, 70);
            this.Smoker = (s > 0);
            this.Diabetic =(d > 0);
        }
    }
}
